# İleri Birleştirme İşlemleri

In [1]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({"Çalışanlar": ["Ali", "Veli", "Ayşe", "Fatma"],
                    "Grup": ["Muhasebe", "Mühendislik", "Mühendislik", "İK"]})

df1

  Çalışanlar         Grup
0        Ali     Muhasebe
1       Veli  Mühendislik
2       Ayşe  Mühendislik
3      Fatma           İK

In [2]:
df2 = pd.DataFrame({"Çalışanlar": ["Ali", "Veli", "Ayşe", "Fatma"], "İlk Giriş Yılı": [2010, 2009, 2014, 2019]})
df2

  Çalışanlar  İlk Giriş Yılı
0        Ali            2010
1       Veli            2009
2       Ayşe            2014
3      Fatma            2019

### .merge()

- .merge() fonksiyonu ile birebir birleştirme işlemlerini gerçekleştirebiliriz.
- Merge komutu ile yapılan işlemleri SQL’de bulunan inner join, outer join … ‘e benzetebiliriz.

In [3]:
pd.merge(df1, df2)

  Çalışanlar         Grup  İlk Giriş Yılı
0        Ali     Muhasebe            2010
1       Veli  Mühendislik            2009
2       Ayşe  Mühendislik            2014
3      Fatma           İK            2019

In [4]:
pd.merge(df1, df2 , on="Çalışanlar") # on parametresi ile hangi sütun üzerinden birleştirileceğini belirtiyoruz.

  Çalışanlar         Grup  İlk Giriş Yılı
0        Ali     Muhasebe            2010
1       Veli  Mühendislik            2009
2       Ayşe  Mühendislik            2014
3      Fatma           İK            2019

In [6]:
df3 = pd.merge(df1, df2)
df3

  Çalışanlar         Grup  İlk Giriş Yılı
0        Ali     Muhasebe            2010
1       Veli  Mühendislik            2009
2       Ayşe  Mühendislik            2014
3      Fatma           İK            2019

In [8]:
df4 = pd.DataFrame({"Grup": ["Muhasebe", "Mühendislik", "İK"], "Müdür": ["Caner", "Mustafa", "Berkcan"]})
df4

          Grup    Müdür
0     Muhasebe    Caner
1  Mühendislik  Mustafa
2           İK  Berkcan

In [9]:
pd.merge(df3, df4)

  Çalışanlar         Grup  İlk Giriş Yılı    Müdür
0        Ali     Muhasebe            2010    Caner
1       Veli  Mühendislik            2009  Mustafa
2       Ayşe  Mühendislik            2014  Mustafa
3      Fatma           İK            2019  Berkcan

In [10]:
df5 = pd.DataFrame({"Grup": ["Muhasebe", "Muhasebe", "Mühendislik", "Mühendislik", "İK", "İK"], "Yetenekler": ["Matematik", "Excel", "Kodlama", "Linux", "Excel", "Yönetim"]})
df5

          Grup Yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Mühendislik    Kodlama
3  Mühendislik      Linux
4           İK      Excel
5           İK    Yönetim

In [11]:
pd.merge(df1, df5)

  Çalışanlar         Grup Yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      Excel
2       Veli  Mühendislik    Kodlama
3       Veli  Mühendislik      Linux
4       Ayşe  Mühendislik    Kodlama
5       Ayşe  Mühendislik      Linux
6      Fatma           İK      Excel
7      Fatma           İK    Yönetim

# Toplulaştırma ve Gruplama İşlemleri (Aggregation & Grouping)

### Basit Toplulaştırma İşlemleri
- count() : Eleman sayısı
- first(), last() : İlk ve son eleman
- mean(), median() : Ortalama ve medyan
- min(), max() : Minimum ve maksimum değer
- std(), var() : Standart sapma ve varyans
- sum() : Toplam değer

In [12]:
import seaborn as sns
df = sns.load_dataset("planets")

In [13]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [14]:
df.shape

(1035, 6)

In [16]:
df.count()

method            1035
number            1035
orbital_period     992
mass               513
distance           808
year              1035
dtype: int64

In [17]:
df.mean()

C:\Users\BERKCAN\AppData\Local\Temp\ipykernel_38616\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [18]:
df["mass"].mean()

2.6381605847953216

In [19]:
df["mass"].count()

513

In [20]:
df["mass"].min()

0.0036

In [21]:
df["mass"].max()

25.0

In [22]:
df["mass"].sum()

1353.37638

In [23]:
df["mass"].std()

3.8186166509616046

In [25]:
df["mass"].var()

14.58183312700122

In [27]:
df.describe() # sayısal değerlerin istatistiksel özelliklerini verir.

            number  orbital_period        mass     distance         year
count  1035.000000      992.000000  513.000000   808.000000  1035.000000
mean      1.785507     2002.917596    2.638161   264.069282  2009.070531
std       1.240976    26014.728304    3.818617   733.116493     3.972567
min       1.000000        0.090706    0.003600     1.350000  1989.000000
25%       1.000000        5.442540    0.229000    32.560000  2007.000000
50%       1.000000       39.979500    1.260000    55.250000  2010.000000
75%       2.000000      526.005000    3.040000   178.500000  2012.000000
max       7.000000   730000.000000   25.000000  8500.000000  2014.000000

In [28]:
df.describe().T # T ile transpozunu alıyoruz. Yani sütunları satırlara, satırları sütunlara çeviriyoruz.

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [29]:
df.dropna().describe().T # dropna ile eksik değerleri atıyoruz.

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0